Documents/ДвижениеТовара.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.14">
	<Document>
		<Properties>
			<Name>ДвижениеТовара</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.Товары</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказНаПродажу</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказНаЗакупку</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Партия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Партии</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Упаковка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УпаковкиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоУпаковок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕдиницаИзмерения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МестоОтправления</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.НаправлениеДвиженияТовара</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МестоПолучения</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.НаправлениеДвиженияТовара</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидДвиженияПланФакт</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыДвиженияПланФакт</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/ДвижениеТовара/Ext/ManagerModule.bsl
Функция РеквизитыНедоступныеДляРедактирования() Экспорт

	Реквизиты = Новый Массив;
	Реквизиты.Добавить("Дата");
	Реквизиты.Добавить("ДокументОснование");
	Реквизиты.Добавить("Номенклатура");
	Реквизиты.Добавить("Упаковка");
	Реквизиты.Добавить("КоличествоУпаковок");
	Реквизиты.Добавить("ЕдиницаИзмерения");
	Реквизиты.Добавить("Количество");
	Реквизиты.Добавить("МестоОтправления");
	Реквизиты.Добавить("МестоПолучения");
	Реквизиты.Добавить("ВидДвиженияПланФакт");
	
	Возврат Реквизиты;
	
КонецФункции // РеквизитыНедоступныеДляРедактирования()
